---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingBadOffset
source: html/7fa6144f-3c7b-c927-4e76-4814cf357eeb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingBadOffset Property

An arc in the railing sketch has a radius that conflicts with the current rail widths and offsets. Please either increase the radius or modify rail profiles and offsets.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingBadOffset { get; }
```